/**
 * @ Author: willysliang
 * @ Create Time: 2023-02-03 11:07:15
 * @ Modified by: willysliang
 * @ Modified time: 2023-02-03 11:46:56
 * @ Description: 标签数据
 */

const taglist = [
  {
    id: 1,
    type: 1,
    name: '支出33333333333a大公司就大公的撒个大大贾湖骨笛科技阿给大家尬的骄傲圣诞节嘎肯定会噶几给大家观看司就扶桑法1',
    user_id: '32372893',
    icon: '327328937',
  },
  {
    id: 41,
    type: 1,
    name: '支出33333333333a大公司就大公的撒个大大贾湖骨笛科技阿给大家尬的骄傲圣诞节嘎肯定会噶几给大家观看司就扶桑法1',
    user_id: '32372893',
    icon: '327328937',
  },
  {
    id: 51,
    type: 1,
    name: '支出33333333333a大公司就大公的撒个大大贾湖骨笛科技阿给大家尬的骄傲圣诞节嘎肯定会噶几给大家观看司就扶桑法1',
    user_id: '32372893',
    icon: '327328937',
  },
  {
    id: 61,
    type: 1,
    name: '支出33333333333a大公司就大公的撒个大大贾湖骨笛科技阿给大家尬的骄傲圣诞节嘎肯定会噶几给大家观看司就扶桑法1',
    user_id: '32372893',
    icon: '327328937',
  },
  {
    id: 241,
    type: 2,
    name: '支出33333333333a大公司就大公的撒个大大贾湖骨笛科技阿给大家尬的骄傲圣诞节嘎肯定会噶几给大家观看司就扶桑法1',
    user_id: '32372893',
    icon: '327328937',
  },
  {
    id: 512,
    type: 2,
    name: '支出33333333333a大公司就大公的撒个大大贾湖骨笛科技阿给大家尬的骄傲圣诞节嘎肯定会噶几给大家观看司就扶桑法1',
    user_id: '32372893',
    icon: '327328937',
  },
  {
    id: 22,
    type: 2,
    name: '支出33333333333a大公司就大公的撒个大大贾湖骨笛科技阿给大家尬的骄傲圣诞节嘎肯定会噶几给大家观看司就扶桑法1',
    user_id: '32372893',
    icon: '327328937',
  },
  {
    id: 2,
    type: 2,
    name: '支出21',
    user_id: '32372893',
    icon: '327328937',
  },
  {
    id: 332,
    type: 3,
    name: '其他',
    user_id: '32372893',
    icon: '327328937',
  },
]

export default [
  {
    url: '/tag/list',
    method: 'post',
    response() {
      return {
        code: 200,
        msg: 'success',
        data: taglist,
      }
    },
  },
]
